{
    "testimonial": [
        {
            "key": 1,
        "name": "Shaquilla",
        "image": "https://i.imgur.com/Aq22Vxj.jpg",
        "text":  "Joining Toastmasters 2 years ago has had such a postive effect on me. I am a far more eloquent, competent and creative speaker; and during the Covid-19 pandemic andhaving all communications move to video calls, I have become more flexible and versatile in my style. These skills I know will be 100% applicable in our new normal! Toastmasters has also allowed me to build in my leadership potential. There is ample opprtuntiy to develop yourself, develop others through mentorship and develop your club to be the best that it could possibly be, through being a part of the club committee. Patiently, I wait for the pandemic to come to an end so we can go back to in person meetings where I can see all the smiling faces of my fellow members."
        },
        {
             "key": 2,
        "name": "Fedor",
        "image": "https://i.imgur.com/X33jYiE.jpg",
        "text":  " I have benefitted so much from being a member of Toastmasters. Firstly, the skills I acquired gave me the confidence to accept a job that required frequent public speaking appearances. Secondly, I have gained evaluation skills that now enable me to give constructive feedback to others using a positive format that highlights points for improvement in an acceptable, non-threatening way. I have also had the pleasure over the years of meeting so many interesting people from different walks of life. I can warmly recommend Toastmasters as a great and extremely cost-effective way to improve your public speaking, communication skills and grow in self-confidence."
        },
                {
                     "key": 3,
        "name": "Pippa",
        "image": "https://i.imgur.com/2xaVYBa.jpg",
        "text":  "I am what you might call a “legacy” in that my mum was a Toastmaster for many years. I am following in her footsteps as well as forging my own path. For me, TMI has allowed me to practice speaking in a safe environment and try out techniques that I might not have had the  supportive and encouraging that you feel free to try things out and give it a go. I have learned that my nerves before a speech can be harnessed as energy rather than a roadblock, and I have learned that nervousness just means I care and want to do my best. I still get nervous but that’s perfectly normal– it’s how you respond to it that matters. Even after many years of being at Paddington TM, I am still learning new skills and really enjoy the relaxed and fun spirit of our club"
        },
        {
             "key": 4,
        "name": "Matt",
        "image": "",
        "text": "Being a member of PTM has grown my confidence to speak in public, something I was unsure about when I joined! In particular, I feel I have grown in my ability to engage an audience, which has helped me present better at work. One thing I love about PTM is the friendly and encouraging vibe - there are so many amazing people to listen and learn from! "
        },
        {
             "key": 5,
        "name": "Léa",
        "image": "",
        "text": "What I like the most about PTM is to be able to gain more confidence in public speaking in the safe, geniune and friendly space the club has created over time. Each evening is full of laughers and a great opportunity to meet people from diverse background. The continuous support I get from the club has been invaluable in my progress."
        },
        {
             "key": 6,
            "name": "DJ",
            "image": "https://i.imgur.com/ySUyRKw.jpg",
            "text": "With my new role came the responsibility to speak at public conferences. Within a year, I gained the ability and confidence to speak in front of 300 people and deliver a conference talk rated 4 out of 27. All the while doing it with a fantastic group of individuals I now call my friends.  PTM isn't just a chance; it's an electrifying adventure you won't regret."
        },
        {
          "key": 7,
         "name": "Magu",
         "image": "",
         "text": "I joined Paddington Toastmasters looking to improve my public speaking skills. Little did I know the benefits would spread much further, including improving my listening and feedback skills, leadership opportunities and mentorships, and meeting a network of interesting people from diverse backgrounds. I enjoy learning from and about my fellow PTM members through their speeches, and celebrating our continuous growth and development. Paddington Toastmasters truly is a club like no other; the support and camaraderie I feel as a member has made all the difference for me, and I recommend joining to anyone seeking further personal growth, increased self-confidence, and learning in a supportive environment."
     },
     {
          "key": 8,
         "name": "Magu",
         "image": "https://i.imgur.com/1YVi3iu.jpg",
         "alt": "Magu our Club President",
         "text": "Public speaking is a crucial skill that can often feel intimidating. To stand in front of an audience with all eyes on you as you deliver a speech can be daunting, yet few things can feel more empowering than taking the stage and delivering your message to an audience. This is why having the right support to develop this skill can make all the difference. From my very first meeting I received the support I needed at Paddington Toastmasters. My fellow members made me feel welcome, the VP of Education guided me on Pathways, I received constructive feedback after each of my speeches, and throughout this experience I grew more confident to take on public speaking and leadership roles. At Paddington Toastmasters you’ll find an environment that is friendly, constructive, encouraging and full of camaraderie. Our meetings are enjoyable and motivating, ensuring our members stay engaged. Paddington Toastmasters isn't just a club; it's a supportive community that empowers members on their public speaking and leadership journeys. You’re welcome to join us!"
     }



        
        

    ]
}